## Pandas가 무엇인가요?

In [ ]:
import pandas as pd

In [ ]:
data_frame = pd.read_csv('https://hiclass.hannam.ac.kr/courses/13300/files/323871/download?verifier=KPVcrvpjlYoHXv09xS8dGSyz5UXUCCa0OnJJm280')

In [ ]:
data_frame

In [ ]:
data_frame.tail(2)

In [ ]:
type(data_frame.student)

In [ ]:
list_tmp = [1,2,3]

In [ ]:
list_tmp

In [ ]:
s1 = pd.core.series.Series([1,2,3])

In [ ]:
s2 = pd.core.series.Series(['one','two','three'])

In [ ]:
pd.DataFrame(data=dict(num=s1, word=s2))

## Pandas_tutorial

In [ ]:
import pandas as pd

In [ ]:
#df = pd.read_csv('https://hiclass.hannam.ac.kr/courses/13300/files/323871/download?verifier=KPVcrvpjlYoHXv09xS8dGSyz5UXUCCa0OnJJm280', header = None)
#df.columns = ['name','age','job']
df = pd.read_csv('C:/Users/choye/Python_Application/friend_list_no_head.csv', header = None,names=['name','age','job'])

In [ ]:
df

## Create DataFrame from your python code

In [ ]:
import pandas as pd

In [ ]:
friend_dict_list = [
    {'name':'John', 'age':25, 'job':'student'},
    {'name':'Nate', 'age':30, 'job':'teacher'}
]

In [ ]:
df = pd.DataFrame(friend_dict_list)

In [ ]:
df.head()

In [ ]:
df = df[['name', 'age', 'job']]

In [ ]:
df.head()

In [ ]:
from collections import OrderedDict

In [ ]:
friend_Ordered_dict = OrderedDict(
    [
        ('name',['John', 'Nate']),
        ('age',[25, 30]),
        ('job',['student','teacher'])
    ]
)

In [ ]:
df = pd.DataFrame(friend_Ordered_dict)

In [ ]:
df.head()

In [ ]:
friend_list = [
    ['John',20,'student'],
    ['Nate',30,'teacher']
]

In [ ]:
column_name = ['name', 'age', 'job']

In [ ]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [ ]:
df.head()

In [ ]:
friend_list = [
        ['name', ['John', 'Nate']],
        ['age', [20, 30]],
        ['job', ['student','teacher']]
]

In [ ]:
df = pd.DataFrame.from_items(friend_list)

In [ ]:
df.head()

## Writh DataFrame To File

In [ ]:
import pandas as pd

In [ ]:
friends = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': None},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friends)
df = df[['name', 'age', 'job']]

In [ ]:
df.head()

In [ ]:
df.to_csv('friend_list_from_df.csv', header = False, index = False, na_rep = '-')

In [ ]:
df.head()

## Pandas - Selest, Filter Rows or Columns

In [1]:
import pandas as pd

In [2]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

C:\Users\choye\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [3]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [4]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [5]:
df = df[1:3]

In [6]:
df

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [7]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

C:\Users\choye\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [8]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [9]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [10]:
df = df.loc[[0,2]]

In [11]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

C:\Users\choye\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [12]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### by column condition

In [13]:
df[df.age > 25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [14]:
df.query('age > 25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [15]:
df[(df.age > 25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

### Filter Column

#### by index

In [16]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher']
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [17]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [18]:
df.iloc[0:2,0:2]

       0   1
0   John  20
1  Jenny  30

#### by column name

In [19]:
#df = pd.read_csv('https://hiclass.hannam.ac.kr/courses/13300/files/323871/download?verifier=KPVcrvpjlYoHXv09xS8dGSyz5UXUCCa0OnJJm280', header = None)
#df.columns = ['name','age','job']
df = pd.read_csv('C:/Users/choye/Python_Application/friend_list_no_head.csv', header = None,names=['name','age','job'])

In [20]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [21]:
df_filtered = df[['name', 'age']]

In [22]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [23]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [24]:
df.filter(like='a',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [25]:
df.filter(regex='e$',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

## Drop row or column

In [ ]:
import pandas as pd

friends = [{'age': 15, 'job': 'student'},
         {'age': 25, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                 columns = ['age','job'])

In [ ]:
df

In [ ]:
df.drop(['John','Nate'])

In [ ]:
df

In [ ]:
df =  df.drop(['John','Nate'])

In [ ]:
df

In [ ]:
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                 columns = ['age','job'])

In [ ]:
df

In [ ]:
df.drop(['John','Nate'], inplace = True)

In [ ]:
df

In [ ]:
friends = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Ben', 'age': 25, 'job': 'developer'},
         {'name': 'Jenny', 'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friends,
                 columns = ['name','age','job'])

In [ ]:
df

In [ ]:
df = df.drop(df.index[[0,2]])

In [ ]:
df

In [ ]:
df = pd.DataFrame(friends,
                 columns = ['name','age','job'])

In [ ]:
df

In [ ]:
df = df[df.age > 20]

In [ ]:
df

In [ ]:
df = pd.DataFrame(friends,
                 columns = ['name','age','job'])

In [ ]:
df

In [ ]:
df = df.drop('age', axis=1)

In [ ]:
df

In [ ]:
df = pd.DataFrame(friends,
                 columns = ['name','age','job'])

In [ ]:
df

In [ ]:
df.drop('age', axis=1, inplace=True)

In [ ]:
df